app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users"
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_digest", "admin", "activation_digest", "activated", "activated_at", "reset_digest", "reset_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "updated_at" = ?, "remember_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-25 14:19:28.709553"], ["remember_digest", "$2a$04$qpJFqW.EaCfHzxEy3O5Pte8W7HsnrWtBXAMERuCpoFhm6ARvI26o2"], ["id", 762146111]]
---
  def update
    if @user.update(user_params)